blog-posts/2009-01-21-upcoming-talk-totally-rocking-your-drupal-development-environment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Upcoming talk: Totally Rocking Your Drupal Development Environment</title>
<!-- 2015-10-19 Mon 14:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Upcoming talk: Totally Rocking Your Drupal Development Environment</h1>
<p>
January 21st, 2009 -
<a href="http://sachachua.com/blog/p/5649"><a href="http://sachachua.com/blog/p/5649">http://sachachua.com/blog/p/5649</a></a>
</p>

<p>
On February 12, at 12 EST, I'll be giving a teleconference presentation
to the IBM Drupal Users Group. =) It's internal-only, but I wanted to
post it here because I often need to look up my abstracts and bios. The
abstract is the same as the talk I submitted to
<a href="http://dc2009.drupalcon.org/session/totally-rocking-your-development-environment">DrupalCon09
(Totally Rocking Your Development Environment)</a>, but I'll add some more
IBM-specific tips.
</p>

<p>
<b>Abstract:</b>
</p>

<blockquote>
<p>
Are you a lazy developer? If you aren't, you should be! Find out about
editor tricks that can save you hours and hours of effort and
frustration. Learn about browser tips that make it easy to test your
sites with different users, track down elusive bugs, and test. Develop
the virtue of laziness by automating as much as you can with
makefiles, the Drupal Shell, regression tests, and other goodies.
Share your best tips during this interactive session. Use your new
free time to rock even more!
</p>
</blockquote>

<p>
<b>Bio</b>
</p>

<blockquote>
<p>
Sacha Chua has an unshakable belief that life is too short to waste
doing repetitive tasks that can be automated, an irrational love for
tweaking her development environment, and an irresistible urge to
share whatever she's learned along the way. To learn more about her
and Web 2.0, Drupal, Emacs, and other things she's interested, visit
[INTERNAL IBM URL] or
<a href="http://livinganawesomelife.com"><a href="http://LivingAnAwesomeLife.com">http://LivingAnAwesomeLife.com</a></a>
(personal blog).
</p>
</blockquote>

<p>
Inside IBM and want to get a copy of the calendar invite? Contact
William Shaouy.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
